Feature: Διαχείριση στοιχείων
  Σαν Διαχειριστής
  Θέλω να αλλάξω τα στοίχεία ενός Χρήστη
  Για να είναι τα πραγματικά
  
  
Scenario: Αλλαγή στοιχείων Χρήστη
  Given οτι είμαι στην αρχική σελίδα
  When πατάω στο κουμπί "Admin Users"
  Then εμφανίζεται η σελίδα με τη λίστα όλων των Χρηστών
  When επιλέγω το όνομα του "Χρήστη" που θέλω
  Then εμφανίζεται η σελίδα με τα στοιχεία του Χρήστη
  When κάνω κλικ στο κουμπί "edit" δίπλα απο το username του
  Then οδηγούμε στη σελίδα "Εγγραφή Χρήστη"
  When κάνω κλικ στο πεδίο με τα στοιχεία του χρήστη που θέλω να αλλάξω
  Then το ήδη υπάρχων κείμενο εξαφανίζετε
  And πληκτρολογώ τα καινούργια στοιχεία
  Then κάνω κλικ στην επιλογή "Εγγραφή"
  Then εμφανίζεται μύνημα "Να σωθούν οι αλλαγές?"
  Then πατάω στην επιλογή "ΥΕS"
  Και επανέρχομαι στη σελίδα με τα στοιχεία του Χρήστη
  
Scenario: Αλλαγή στοιχείων επιχείρησης
  Given οτι είμαι στην αρχική σελίδα
  When πατάω στο κουμπί "Admin Users"
  Then εμφανίζεται η σελίδα με τη λίστα όλων των Χρηστών
  When επιλέγω το όνομα του "Χρήστη" που θέλω
  Then εμφανίζεται η σελίδα με τα στοιχεία του Χρήστη
  When κάνω κλικ στο κουμπί "edit" δίπλα απο το username του
  Then οδηγούμε στη σελίδα "Εγγραφή Επαγγελματία"
  When κάνω κλικ στο πεδίο με τα στοιχεία της επιχείρησης που θέλω να αλλάξω
  Then το ήδη υπάρχων κείμενο εξαφανίζετε
  And πληκτρολογώ τα καινούργια στοιχεία
  Then κάνω κλικ στην επιλογή "Εγγραφή"
  Then εμφανίζεται μύνημα "Να σωθούν οι αλλαγές?"
  Then πατάω στην επιλογή "ΥΕS"
  Και επανέρχομαι στη σελίδα με τα στοιχεία του Χρήστη
  
Scenario: Διαγραφή Χρήστη
  Given οτι είμαι στην αρχική σελίδα
  When πατάω στο κουμπί "Admin Users"
  Then εμφανίζεται η σελίδα με τη λίστα όλων των Χρηστών
  When επιλέγω το όνομα του "Χρήστη" που θέλω
  Then εμφανίζεται η σελίδα με τα στοιχεία του Χρήστη
  When κάνω κλικ στο κουμπί "delete" δίπλα απο το username του
  Then εμφανίζεται μύνημα "Είστε σίγουροι για την επιλογή αυτή?"
  Then πατάω στην επιλογή "ΥΕS"
  And επανέρχομαι στη σελίδα με τη λίστα όλων των Χρηστών
  
Scenario: Διαγραφή επιχείρησης
  Given οτι είμαι στην αρχική σελίδα
  When πατάω στο κουμπί "Admin Users"
  Then εμφανίζεται η σελίδα με τη λίστα όλων των Χρηστών
  When επιλέγω το όνομα του "Χρήστη" που θέλω
  Then εμφανίζεται η σελίδα με τα στοιχεία του Χρήστη
  When κάνω κλικ στο κουμπί "delete" δίπλα απο το username του
  Then εμφανίζεται μύνημα "Είστε σίγουροι για την επιλογή αυτή?"
  Then πατάω στην επιλογή "ΥΕS"
  And επανέρχομαι στη σελίδα με τη λίστα όλων των Χρηστών
