Feature: User False Reservation and penalty
  Σαν επιχειρηματίας
  Για να ενημερώσω τον Διαχειριστή για μια ψευδή κράτηση
  θέλω να επικοινωνήσω με τον Διαχειριστή
  
  
Scenario: Ο επιχειρηματίας ενημερώνει το Διαχειριστή για αναληθή κράτηση
  Given βρίσκομαι στη σελίδα των κρατήσεών μου
  When διαπιστώνω αναληθή κράτηση από κάποιο χρήστη
  And κάνω κλικ στο κουμπί "Ρυθμίσεις"
  Then εμφανίζεται η σελίδα ρυθμίσεών μου
  And κάνω κλικ πάνω στο κουμπί “επικοινωνία με το διαχειριστή”
  Then ανοίγει μία φόρμα επικοινωνίας την οποία συμπληρώνω
  When κάνω κλικ στο κουμπί "Αποστολή"
  Then οδηγούμαι πίσω στη σελίδα ρυθμίσεων
  And το σύστημα επιβεβαιώνει την αποστολή της φόρμας επικοινωνίας 

Scenario: ο διαχειριστής επιβάλει "τιμωρία" στο χρήστη.
	Given οτι σαν Διαχειριστής έχω ενημερωθεί για αναληθή κράτηση
  When κάνω κλικ στο όνομα του Χρήστη που έχει κάνει την αναληθή κράτηση
  Then οδηγούμαι στη σελίδα με τα προσωπικά στοιχεία του Χρήστη
  When κάνω κλικ στο κουμπί "Warning"
  Then εμγανίζεται μήνυμα "Do you want to send User a warning?"
  When επιλέγω "YES"
  Then οδηγούμαι στη σελίδα με τα προσωπικά στοιχεία του Χρήστη
  And o Χρήστης ενημερώνεται με μήνυμα
