Feature: List of interest
  Σαν Χρήστης 
  Για να φτιάξω μια λίστα με σημεία ενδιαφέροντος
  θέλω να προσθέσω, αφαιρέσω και να δημιουργήσω τη λίστα αυτή
  
Scenario: Δημιουργία λίστας ενδιαφέροντος
  Given οτι είμαι στη σελίδα ενος σημείου ενδιαφέροντος
  When πατάω στο εικονίδιο "καρδιά" κάτω απο την εικόνα του σημείου ενδιαφέροντοςς
  Then εμφανίζετε ένα μήνυμα που με προειδοποιεί οτι "Το σημείου ενδιαφέροντος θα προστεθεί στη λίστα ενδιαφέροντος" μου
  When επιλέγω "OK" 
  Then εμφανίζετε παράθυρο με υπάρχων λίστες μου και την επιλογή "δημιουργία νέας"
  Then επιλέγω "δημιουργία νέας"
  And η εφαρμογή μου ζητάει να την ονομάσω
  When κάνω κλικ στην περιοχή "Όνομα" 
  And πληκτρολογώ το όνομα που θέλω
  And πατάω "ΟΚ"
  Τhen η λίστα δημιουργείτε στο τέλος των ήδη υπάρχων
  
  
Scenario: Διαγραφή λίστας ενδιαφέροντος
  Given οτι είμαι στην αρχική σελίδα
  When πατάω στο εικονίδιο "καρδιά" στην επάνω δεξιά γωνία δίπλα απο το username
  Then εμφανίζετε η σελίδα με τις λίστες μου
  When κάνω κλικ στο κουτάκι δίπλα απο το όνομα τις λίστα
  And κάνω κλικ στο κουτάκι "delete" απο πάνω
  Τhen εμφανίζετε μήνυμα "είστε σίγουρος οτι θέλετε να διαγραφεί?"
  And πατάω "ΟΚ"
  Τhen επανέρχομαι στη σελίδα με τις λίστες μου
  
  
Scenario: Εισαγωγή σημείου ενδιαφέροντος στη λίστα
  Given οτι είμαι στη σελίδα ενος σημείου ενδιαφέροντος
  When πατάω στο εικονίδιο "καρδιά" κάτω απο την εικόνα του σημείου ενδιαφέροντος
  Then εμφανίζετε ένα μήνυμα που με προειδοποιεί οτι "Το σημείου ενδιαφέροντος θα προστεθεί στη λίστα ενδιαφέροντος" μου
  When επιλέγω "OK" 
  Then εμφανίζετε παράθυρο με υπάρχων λίστες μου
  Then επιλέγω μια λίστα 
  Then εμφανίζεται μήνυμα "είστε σίγουρος οτι θέλετε να προσθέσετε αυτό το σημείο ενδιαφέροντος σε αυτή τη λίστα?"
  And πατάω "ΥΕS"
  Τhen το σημείο ενδιαφέροντος έχει προστεθεί στην λίστα
  Then επανέρχομαι στη σελίδα του σημείου ενδιαφέροντος
  And το κουμπί "καρδιά" έχει γίνει τώρα κόκκινο
  
  
Scenario: αφαίρεση σημείου ενδιαφέροντος απο λίστα
  Given οτι είμαι στη σελίδα ενος σημείου ενδιαφέροντος
  And το κουμπί "καρδιά" στο σημείο ενδιαφέροντος είναι κόκκινο
  When κάνω κλικ στο κουμπί "καρδιά"
  Then εμφανίζετε μήνυμα "Το σημείου ενδιαφέροντος θα αφαιρεθεί απο τη λίστα ενδιαφέροντος"
  When επιλέγω "ΟΚ"
  Then επανέρχομαι στη σελίδα του σημείου ενδιαφέροντος
  And το κουμπί "καρδιά" έχει γίνει λευκό
