Feature: Login στην εφαρμογή
  Σαν Χρήστης 
  Για να χρησιμοποιήσω την εφαρμογή
  Θέλω να περιηγηθώ στην κεντρική σελίδα

Scenario: Login σαν Χρήστης
  Given  οτι είμαι στην κεντρική σελίδα
  When κάνω κλικ πάνω στο κουμπί "log in"
  Then θα πρέπει να εμφανιστεί η σελίδα του "log in"
  When εισάγω "Username" και "Password"
  And κάνω κλικ πάνω στο κουμπί "log in"
  Then θα πρέπει να εμφανιστεί η κατάλληλη αρχική σελίδα

Scenario: Login σαν Διαχειριστής
  Given οτι είμαι στην κεντρική σελίδα
  When κάνω κλικ πάνω στο κουμπί "log in"
  Then θα πρέπει να εμφανιστεί η σελίδα του "log in"
  When εισάγω "Username" και "Password"
  And κάνω κλικ πάνω στο κουμπί "log in"
  Then θα πρέπει να εμφανιστεί η κατάλληλη αρχική σελίδα Διαχειριστή

Scenario: Login Fail
  Given οτι είμαι στην κεντρική σελίδα
  When κάνω κλικ πάνω στο κουμπί "log in" 
  Then θα πρέπει να εμφανιστεί η σελίδα του "log in"
  When εισάγω "Username" και "Password"
  And κάνω κλικ πάνω στο κουμπί "log in"
  And το σύστημα δεν αναγνωρίζει τα στοιχεία μου 
  Then θα πρέπει να εμφανιστεί ένα μύνημα "Τα στοιχεία που εισάγατε δεν είναι σωστά"
