Feature: Logout απο την εφαρμογή
  Σαν Χρήστης  
  Για να προστατεύσω τα προσωπικά μου δεδομένα 
  Θέλω να είναι συνατόν να κάνω "Log out" απο την εφαρμογή

Scenario: Logout σαν Χρήστης
  Given ότι είμαι σε οποιαδήποτε σελίδα της εφαρμογής 
  When κάνω κλικ στο κουμπί "Ρυθμίσεις"
  Then ανοίγει ένα drop-down μενού
  Then πατάω στην επιλογή "Log out"
  Then θα πρέπει να εμφανιστεί ένα μύνημα που να με προειδοποιεί οτι είμαι έτοιμος να κάνω "Log out"
  When κάνω κλιν στο κουμπί "Ναι"
  Then θα πρέπει να οδηγηθώ στην αρχική σελίδα σαν Επισκέπτης
  
Scenario: Logout fail
  Given ότι είμαι σε οποιαδήποτε σελίδα της εφαρμογής
  When κάνω κλικ στο κουμπί "Ρυθμίσεις"
  Then ανοίγει ένα drop-down μενού
  Then πατάω στην επιλογή "Log out"
  When I press the "Logout" button
  Then θα πρέπει να εμφανιστεί ένα μύνημα που να με προειδοποιεί οτι είμαι έτοιμος να κάνω "Log out"
  When κάνω κλιν στο κουμπί "Όχι"
  Then θα πρέπει να οδηγηθώ στην αρχική σελίδα σαν Χρήστης
