Feature: Picture upload
  Σαν Χρήστης
  Για να δείξω το πόσο ωραία πέρασα σε ένα σημείο ενδιαφέροντος
  Θέλω να ανεβάσω φωτογραφίες
  
Scenario: Επιτυχές ανέβασμα φωτογραφίας
  Given οτι είμαι στη σελίδα του σημείου ενδιαφέροντος που θέλω
  When κάνω κλικ στο εικονίδιο "Ανέβασμα φωτογραφίας"
  Then εμφανίζεται παράθυρο διαλόγου που μου ζητάει να διαλέξω ποια φωτογραφία θέλω να ανεβάσω
  Then διαλέγω φωτογραφία απο τον τοπικό δίσκο
  And πατάω το κουμπί "ΟΚ"
  Then εμφανίζεται μήνυμα "Η φωτογραφία σας ανέβηκε επιτυχώς"
  And επιστρέφω πίσω στη σελίδα του σημείου ενδιαφέροντος
  
Scenario: Ανεπιτυχής ανέβασμα Φωτογραφίας
  Given οτι είμαι στη σελίδα του σημείου ενδιαφέροντος που θέλω
  When κάνω κλικ στο εικονίδιο "Ανέβασμα φωτογραφίας"
  Then εμφανίζεται παράθυρο διαλόγου που μου ζητάει να διαλέξω ποια φωτογραφία θέλω να ανεβάσω
  Then διαλέγω φωτογραφία απο τον τοπικό δίσκο
  And πατάω το κουμπί "ΟΚ"
  Then εμφανίζεται μήνυμα "Ο τύπος αρχείου δεν υποστηρίζεται απο την εφαρμογή"
  And επιστρέφω πίσω στη σελίδα του σημείου ενδιαφέροντος
  
Scenario: Προβολή ανεβασμένων φωτογραφιών
  Given οτι είμαι στη σελίδα του σημείου ενδιαφέροντος που θέλω
  When κάνω κλικ πάνω σε μια απο τις φωτογραφίες που εμφανίζονται
  Then αυτή ανοίγει σε μεγαλύτερες διαστάσεις για να την δω
  When κάνω κλικ επάνω δεξιά στο σημείο "Χ" 
  Then η φωτογραφία κλείνει
  And επιστρέφω πίσω στη σελίδα του σημείου ενδιαφέροντος
