Feature: Register στην εφαρμογή
  Σαν νεός Χρήστης
  Για να χρησιμοποιήσω την εφαρμογή
  Θέλω να δημιουργήσω έναν λογαριασμό

Scenario: Register
  Given ότι είμαι στην αρχική σελίδα 
  When κάνω κλικ στο κουμπί "Register"
  Then θα πρέπει να οδηγηθώ στη σελίδα "Register"
  When συμπληρώσω "Username", "Password", "Email", "Ονοματεπώνυμο", "Τηλέφωνο", "Διεύθυνση" και "Ημερομηνία Γέννησης"
  And κάνω κλικ στο κουμπί "Εγγραφή"
  Then θα πρέπει να μου έρθει email επιβεβαίωσης
  And θα πρέπει να οδηγηθώ στην αρχική σελίδα
  
Scenario: Register fail
  Given ότι είμαι στην αρχική σελίδα
  When και κάνω κλικ στο κουμπί "Register"
  Then θα πρέπει να οδηγηθώ στην σελίδα "Register"
  When συμπληρώσω "Username", "Password", "Email", "Ονοματεπώνυμο", "Τηλέφωνο", "Διεύθυνση" και "Ημερομηνία Γέννησης"
  And κάνω κλικ στο κουμπί "Εγγραφή"
  Then θα πρέπει να εμφανιστεί ένα μύνημα "Το username που εισάγατε χρησιμοποιήται"
  When συμπληρώσω ξανά "Username", "Password", "Email", "Ονοματεπώνυμο", "Τηλέφωνο", "Διεύθυνση" και "Ημερομηνία Γέννησης"
  And I press the Signup button
  Then θα πρέπει να μου έρθει email επιβεβαίωσης
  And θα πρέπει να οδηγηθώ στην αρχική σελίδα
