Feature: Αναζήτηση
  Σαν Χρήστης
  Για να βρω ένα μέρος που θέλω να επισκευθώ
  Θέλω να κάνω αναζήτηση

Scenario: Αναζήτηση σαν Χρήστης 
  Given οτι είμαι στην αρχική σελίδα
  When κάνω κλικ στην "περιοχή αναζήτησης" και πληκτρολογώ στο όνομα μιας πόλης
  And πατάω το κουμπί "Αναζήτηση"
  And πατάω στην επιλογή "Πόλη"
  Then θα πρέπει να οδηγηθώ στην σελίδα αποτελεσμάτων
  And θα πρέπει να είμαι σε θέση να διαλέξω το σημείο ενδιαφέροντως που θέλω
  
Scenario: Αναζήτηση σαν Επισκέπτης
  Given οτι είμαι στην αρχική σελίδα
  When κάνω κλικ στην "περιοχή αναζήτησης" και πληκτρολογώ το όνομα μιας πόλης
  And πατάω στην επιλογή "Πόλη"
  And πατάω το κουμπί "Αναζήτηση"
  Then θα πρέπει να οδηγηθώ στην σελίδα αποτελεσμάτων
  And θα πρέπει να είμαι σε θέση να διαλέξω το σημείο ενδιαφέροντως που θέλω
  
Scenario: Αναζήτηση σαν Χρήστης με επιλογές κατηγορίας
  Given οτι είμαι στην αρχική σελίδα
  When κάνω κλικ στην "περιοχή αναζήτησης" και πληκτρολογώ στο όνομα μιας πόλης
  And πατάω το κουμπί "Αναζήτηση"
  And πατάω στην επιλογή "Πόλη"
  Then θα πρέπει να οδηγηθώ στην σελίδα αποτελεσμάτων
  When διαλέξω το σημείο ενδιαφέροντως που θέλω
  Then θα οδηγηθώ στη σελίδα του σημείου ενδιαφέροντος που θέλω
  And θα είμαι σε θέση να διαλέξω την κατηγορία της επιλογής μου
  When πατήσω την κατηγορία που θέλω
  Then θα είμαι σε θάση να διαλέξω υποκατηγορία
  And να μπορώ να οδηγηθώ σε ένα σημείο ενδιαφέροντος που θα διαλέξω
