Feature: User Update Info
  Σαν Χρήστης
  Για να αλλάξω τα στοιχεία μου
  Θέλω να έχω πρόσβαση σε αυτά
  
Scenario:Εισαγωγή νέου email
  Given οτι είμαι στην Κεντρική σελίδα
  When κάνω κλικ στο “εικονίδιο ρυθμίσεων” πάνω δεξιά
  Then οδηγούμαι στη σελίδα των ρυθμίσεων μου
  When επιλέγω και πατάω πάνω στο κουμπί “στοιχεία χρήστη”
  Then οδηγούμαι στη σελίδα με τα στοιχεία μου σαν χρήστης
  When κάνω κλικ πάνω στο κουμπί "Edit" δίπλα από το όνομα χρήστη
  Then το πεδίο σε κάθε στοιχείο μου ανοίγει 
  And μπορώ να γράψω
  When αλλάζω το email address
  And πατάω το κουμπί "Εγγραφή"
  Then εμφανίζεται μήνυμα "να Σωθούν οι αλλαγές?"
  Then πατάω στην επιλογή “Yes”
  And επανέρχομαι στη σελίδα με τα στοιχεία μου ως Χρήστης

Scenario: Διαγραφή χρήστη
  Given οτι είμαι στην κεντρική σελίδα
  When κάνω κλικ στο "εικονίδιο ρυθμίσεων" πάνω δεξιά
  Then οδηγούμαι στη σελίδα των ρυθμίσεων μου
  When επιλέγω και πατάω πάνω στο κουμπί "στοιχεία χρήστη"
  Then οδηγούμαι στη σελίδα με τα στοιχεία μου σαν χρήστης
  When κάνω κλικ στο κουμπί "delete" δίπλα από το όνομα χρήστη
  Then εμφανίζεται μήνυμα "Είστε σίγουροι για την επιλογή αυτή?"
  Then πατάω στην επιλογή "Yes"
  And επανέρχομαι στην αρχική σελίδα της εφαρμογής σαν Επισκέπτης
  
Scenario: ανεπιτυχής αλλαγή στοιχείων
  Given οτι είμαι στην κεντρική σελίδα
  When κάνω κλικ στο "εικονίδιο ρυθμίσεων" πάνω δεξιά
  Then οδηγούμαι στη σελίδα των ρυθμίσεων μου
  When επιλέγω και πατάω πάνω στο κουμπί "στοιχεία χρήστη"
  Then οδηγούμαι στη σελίδα με τα στοιχεία μου σαν χρήστης
  When κάνω κλικ πάνω στο κουμπί "Edit" δίπλα από το όνομα χρήστη
  Then το πεδίο σε κάθε στοιχείο μου ανοίγει
  And μπορώ να γράψω
  When αλλάζω τα στοιχέια που θέλω
  And αφήνω κενό το πεδίο "email adress"
  When πατάω το κουμπί "Εγγραφή"
  Then εμφανίζεται μήνυμα "να Σωθούν οι αλλαγές?"
  And πατάω στην επιλογή "Yes"
  Then επανέρχομαι στη σελίδα με τα στοιχεία μου ως Χρήστης
  And εμφανίζεται μήνυμα "ανεπιτυχής εισαγωγή στοιχείων"
  

