Feature: User Comment 
  Σαν Χρήστης 
  Θέλω να κάνω ένα σχόλιο σε ένα σημείο ενδιαφέροντος
  Για να μειραστώ τις εμπειρίες μου με άλλους χρήστες
  
Scenario: Σχολιασμός Χρήστη στη σε σελίδα σημείου ενδιαφέροντος
  Given οτι έχω κάνει αναζήτηση και έχω βρει το σημείο ενδιαφέροντος που θέλω 
  When κάνω κλικ στο κουμπί "Σχόλιο"
  Then κάτω απο το κουμπί "Σχόλιο" εμφανίζεται μια λίστα με τα ήδη υπάρχων σχόλια άλλων χρηστών
  And μπορώ να τα διαβάσω πηγαίνοντας προς το κάτω μέρος της σελίδας
  Then κάτω απο το τελευταίο σχόλιο υπάρχει μια κενή φόρμα σχολίου στην οποία μπορώ να γράψω
  When τελειώσω να γράφω το σχόλιο μου
  And πατάω το κουμπί "δημοσίευση" στο κάτω μέρος 
  Then οδηγούμε πάνω πάλι στην κορυφή των σχολίων και βλέπω το σχόλιό μου αναρτημένο
