Feature: User messaging
  Σαν Χρήστης
  Για να επικοινωνήσω με έναν άλλο Χρήστη
  Θέλω να του στείλω ένα μήνυμα
  
  
Scenario: Αποστολή μηνύματος Χρήστη
  Given οτι βλέπω τα σχόλια ενός Χρήστη σε ένα σημείο ενδιαφέροντος 
  When κάνω κλικ στο όνομα του Χρήστη
  Then εμφανίζεται η επιλογή "Αποστολή μυνήματος"
  When κάνω κλικ στην επιλογή "Αποστολή μυνήματος"
  Then οδηγούμαι στη σελίδα σύνταξης μηνύματος
  Then πληκτρολογώ το μήνυμα που θέλω 
  And κάνω κλικ στο κουμπί "Αποστολή"
  Then εμφανίζεται μήνυμα "Μήνυμα εστάλει"
  And οδηγούμαι στη σελίδα μηνυμάτων μου
  
Scenario: Αποτυχία Αποστολή μηνύματος Χρήστη
  Given οτι βλέπω τα σχόλια ενός Χρήστη σε ένα σημείο ενδιαφέροντος 
  When κάνω κλικ στο όνομα του Χρήστη
  Then εμφανίζεται η επιλογή "Αποστολή μυνήματος"
  When κάνω κλικ στην επιλογή "Αποστολή μυνήματος"
  Then εμφανίζεται μήνυμα "O Χρήστης δεν μπορεί να δεχτεί μηνύματα"
  And επιστρέφω στη σελίδα του σημείου ενδιαφέροντος που ήμουν
